<template>
    <div>
        <div class="footer position-relative">
            <div class="footer__bg">
                <div class="container_1290 d-flex justify-content-between">
                    <div class="footer__block">
                        <div class="footer__block_title">О сайте</div>
                        <div class="footer__block_text">Квартиры в новостройках Ферганы пользуются большим спросом, на нашем сайте можете размещать не ограниченное колличество квартир в любой из категорий. А так же размещать рекламные и информационные статьи. Удачи!</div>        
                    </div>
                    <div class="footer__block">
                        <div class="footer__block_title">Квартиры</div>
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">1 - комнатные</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">2 - комнатные</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">3 - комнатные</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">4 - комнатные</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">5 - комнатные</nuxt-link>
                        </div>        
                    </div>
                    <div class="footer__block">
                        <div class="footer__block_title">Стоимость</div>
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">До 300 млн</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">До 500 млн</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">До 800 млн</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Более 800 млн</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">С отделкой</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Без отделки</nuxt-link>
                        </div>        
                    </div>
                    <div class="footer__block">
                        <div class="footer__block_title">Квадратура</div>
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Квартиры до 50 м2</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Квартиры до 50 м2 до 57 м2</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Квартиры до 75 м2 до 100 м2</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Квартиры больше 100 м2</nuxt-link>
                        </div> 
                        <div class="footer__block_link"> 
                            <nuxt-link to="#">Квартиры больше 200 м2</nuxt-link>
                        </div>        
                    </div>
                </div>
                <div class="container_1290 d-flex justify-content-between footer__middle">
                    <div class="footer__block">
                        <div class="footer__block_title">Соц сети</div>
                        <div class="d-flex">
                            <div class="footer__block_link"> 
                                <nuxt-link to="#">
                                    <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M21.4227 6.3144C21.3724 5.17322 21.1878 4.38868 20.9234 3.70886C20.6506 2.98724 20.231 2.34118 19.6812 1.80411C19.144 1.25868 18.4936 0.834861 17.7802 0.566408C17.0963 0.302051 16.3157 0.11751 15.1743 0.0671953C14.0244 0.0126196 13.6593 0 10.7428 0C7.82631 0 7.46126 0.0126196 6.3156 0.0629342C5.17421 0.113249 4.38951 0.297954 3.70973 0.562147C2.98781 0.834861 2.34163 1.25442 1.80446 1.80411C1.25892 2.34118 0.835185 2.9915 0.566516 3.70476C0.302109 4.38868 0.117532 5.16896 0.0672082 6.31014C0.012622 7.45983 0 7.82482 0 10.7408C0 13.6567 0.012622 14.0217 0.0629462 15.1671C0.11327 16.3083 0.298011 17.0929 0.562418 17.7727C0.835185 18.4943 1.25892 19.1404 1.80446 19.6774C2.34163 20.2229 2.99208 20.6467 3.70547 20.9151C4.38951 21.1795 5.16995 21.364 6.3115 21.4143C7.45699 21.4648 7.82221 21.4773 10.7387 21.4773C13.6552 21.4773 14.0203 21.4648 15.1659 21.4143C16.3073 21.364 17.092 21.1795 17.7718 20.9151C19.2155 20.3571 20.3569 19.2159 20.915 17.7727C21.1793 17.0888 21.364 16.3083 21.4143 15.1671C21.4647 14.0217 21.4773 13.6567 21.4773 10.7408C21.4773 7.82482 21.473 7.45983 21.4227 6.3144ZM19.4882 15.0832C19.442 16.1321 19.2658 16.6985 19.1189 17.0761C18.758 18.0118 18.0152 18.7544 17.0794 19.1153C16.7017 19.2621 16.1311 19.4383 15.0861 19.4844C13.9531 19.5348 13.6133 19.5473 10.7471 19.5473C7.8809 19.5473 7.53682 19.5348 6.40789 19.4844C5.35879 19.4383 4.79227 19.2621 4.41459 19.1153C3.94889 18.9432 3.52499 18.6705 3.18091 18.3139C2.82422 17.9656 2.55145 17.546 2.37933 17.0804C2.23246 16.7028 2.05624 16.1321 2.01018 15.0875C1.95969 13.9547 1.94723 13.6148 1.94723 10.7491C1.94723 7.88349 1.95969 7.53948 2.01018 6.41093C2.05624 5.36203 2.23246 4.79562 2.37933 4.41801C2.55145 3.95223 2.82422 3.52858 3.18518 3.1844C3.53335 2.82778 3.95299 2.55506 4.41886 2.38314C4.79653 2.23629 5.36731 2.06011 6.41215 2.01389C7.54518 1.96358 7.88516 1.95096 10.7512 1.95096C13.6216 1.95096 13.9614 1.96358 15.0904 2.01389C16.1395 2.06011 16.706 2.23629 17.0837 2.38314C17.5494 2.55506 17.9733 2.82778 18.3173 3.1844C18.674 3.53267 18.9468 3.95223 19.1189 4.41801C19.2658 4.79562 19.442 5.36612 19.4882 6.41093C19.5386 7.54374 19.5512 7.88349 19.5512 10.7491C19.5512 13.6148 19.5386 13.9504 19.4882 15.0832Z"/>
                                        <path d="M10.7428 5.22354C7.69632 5.22354 5.22453 7.69469 5.22453 10.7408C5.22453 13.7868 7.69632 16.258 10.7428 16.258C13.7895 16.258 16.2611 13.7868 16.2611 10.7408C16.2611 7.69469 13.7895 5.22354 10.7428 5.22354ZM10.7428 14.3197C8.76641 14.3197 7.16324 12.717 7.16324 10.7408C7.16324 8.76457 8.76641 7.16188 10.7428 7.16188C12.7194 7.16188 14.3224 8.76457 14.3224 10.7408C14.3224 12.717 12.7194 14.3197 10.7428 14.3197Z"/>
                                        <path d="M17.7677 5.0054C17.7677 5.71669 17.1909 6.29342 16.4793 6.29342C15.7679 6.29342 15.191 5.71669 15.191 5.0054C15.191 4.29395 15.7679 3.71738 16.4793 3.71738C17.1909 3.71738 17.7677 4.29395 17.7677 5.0054Z"/>
                                    </svg>
                                </nuxt-link>
                            </div> 
                            <div class="footer__block_link"> 
                                <nuxt-link to="#">
                                    <svg width="27" height="14" viewBox="0 0 27 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M26.3764 11.8587C26.3049 11.7538 25.8628 10.912 23.7354 9.18172C21.5082 7.36987 21.8074 7.66407 24.4899 4.5312C26.1237 2.62323 26.7769 1.45805 26.5725 0.959938C26.378 0.485128 25.1764 0.610385 25.1764 0.610385L21.1808 0.630775C21.1808 0.630775 20.8849 0.59582 20.6639 0.710881C20.4495 0.824486 20.3115 1.08665 20.3115 1.08665C20.3115 1.08665 19.6783 2.56351 18.834 3.81899C17.0539 6.46831 16.3409 6.60813 16.05 6.44355C15.3736 6.0605 15.5431 4.90261 15.5431 4.08116C15.5431 1.5134 15.9869 0.442891 14.6772 0.166161C14.2417 0.0744034 13.9226 0.0132316 12.8107 0.00303632C11.3846 -0.0100719 10.1763 0.00740573 9.49322 0.300156C9.03781 0.495324 8.68712 0.930809 8.90152 0.955569C9.16579 0.986155 9.76413 1.09685 10.0816 1.47553C10.4921 1.96345 10.4772 3.06163 10.4772 3.06163C10.4772 3.06163 10.7132 6.0838 9.92701 6.45957C9.38684 6.71737 8.64723 6.19158 7.05997 3.78695C6.24722 2.55623 5.63227 1.19443 5.63227 1.19443C5.63227 1.19443 5.51426 0.941004 5.30318 0.805552C5.04722 0.640971 4.68822 0.588538 4.68822 0.588538L0.888762 0.608928C0.888762 0.608928 0.318678 0.623493 0.109259 0.840508C-0.0768913 1.03422 0.0943003 1.43329 0.0943003 1.43329C0.0943003 1.43329 3.06938 7.53153 6.4367 10.6061C9.52646 13.4244 13.0334 13.2394 13.0334 13.2394H14.6223C14.6223 13.2394 15.1026 13.1928 15.347 12.9613C15.573 12.7486 15.5647 12.3495 15.5647 12.3495C15.5647 12.3495 15.5331 10.4809 16.5237 10.2056C17.4993 9.93471 18.7525 12.0116 20.0805 12.8112C21.0844 13.4157 21.8473 13.2831 21.8473 13.2831L25.3991 13.2394C25.3991 13.2394 27.2572 13.1389 26.3764 11.8587Z"/>
                                    </svg>
                                </nuxt-link>
                            </div> 
                            <div class="footer__block_link"> 
                                <nuxt-link to="#">
                                    <svg width="13" height="25" viewBox="0 0 13 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M7.89799 8.4375V5.36932C7.89799 4.5225 8.58527 3.83523 9.43209 3.83523H10.9662V0H7.89799C5.35601 0 3.29572 2.06028 3.29572 4.60227V8.4375H0.227539V12.2727H3.29572V24.5455H7.89799V12.2727H10.9662L12.5003 8.4375H7.89799Z"/>
                                    </svg>
                                </nuxt-link>
                            </div> 
                            <div class="footer__block_link"> 
                                <nuxt-link to="#">
                                    <svg width="24" height="17" viewBox="0 0 24 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M22.8097 2.52108C22.5445 1.53526 21.7672 0.75815 20.7816 0.492699C18.9809 0 11.7779 0 11.7779 0C11.7779 0 4.57515 0 2.77444 0.474019C1.80772 0.739189 1.01151 1.5354 0.74634 2.52108C0.272461 4.32165 0.272461 8.0558 0.272461 8.0558C0.272461 8.0558 0.272461 11.8088 0.74634 13.5905C1.01179 14.5762 1.78876 15.3533 2.77458 15.6188C4.59411 16.1116 11.7781 16.1116 11.7781 16.1116C11.7781 16.1116 18.9809 16.1116 20.7816 15.6376C21.7674 15.3723 22.5445 14.5952 22.8099 13.6095C23.2837 11.8088 23.2837 8.07476 23.2837 8.07476C23.2837 8.07476 23.3026 4.32165 22.8097 2.52108ZM9.48459 11.5055V4.60606L15.4742 8.0558L9.48459 11.5055Z"/>
                                    </svg>
                                </nuxt-link>
                            </div> 
                            <div class="footer__block_link"> 
                                <nuxt-link to="#">
                                    <svg width="21" height="17" viewBox="0 0 21 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M20.9995 1.96747C20.2388 2.30114 19.4283 2.5223 18.5833 2.62969C19.4526 2.11065 20.1161 1.29503 20.428 0.311932C19.6175 0.79517 18.7226 1.13651 17.7689 1.32699C16.9993 0.507529 15.9025 0 14.7059 0C12.3843 0 10.5152 1.88438 10.5152 4.19446C10.5152 4.52685 10.5434 4.84645 10.6124 5.15071C7.12617 4.98068 4.04137 3.3098 1.96907 0.764489C1.60728 1.39219 1.39506 2.11065 1.39506 2.88409C1.39506 4.33636 2.14293 5.62372 3.25771 6.36903C2.58398 6.35625 1.92305 6.16065 1.3631 5.85256C1.3631 5.86534 1.3631 5.88196 1.3631 5.89858C1.3631 7.93636 2.81665 9.62898 4.72276 10.0189C4.38143 10.1122 4.00941 10.157 3.62333 10.157C3.35487 10.157 3.08384 10.1416 2.82944 10.0854C3.37276 11.746 4.91453 12.9669 6.74776 13.0065C5.32106 14.1226 3.50955 14.795 1.54847 14.795C1.20458 14.795 0.874751 14.7797 0.544922 14.7375C2.40245 15.9354 4.60387 16.6193 6.97788 16.6193C14.6944 16.6193 18.9131 10.2273 18.9131 4.68665C18.9131 4.50128 18.9067 4.3223 18.8978 4.1446C19.73 3.55398 20.4293 2.81634 20.9995 1.96747Z"/>
                                    </svg>
                                </nuxt-link>
                            </div> 
                        </div>     
                    </div>
                    <div class="footer__block">
                        <div class="footer__block_title">Адрес:</div>
                        <div class="footer__block_text_sm"> 
                            Фергана,
                            <br>
                            ул. Алишера Навои, 30
                        </div>   
                    </div>
                    <div class="footer__block">
                        <div class="footer__block_title">Телефон:</div>
                        <div class="footer__block_link"> 
                            <a href="tell:+998909000000">998 (90) 900 00 00</a>
                        </div>      
                    </div>
                    <div class="footer__block">
                        <div class="footer__block_btn">
                            <b-button variant="transparent" class="shadow-none">Получить консультацию</b-button>
                        </div>     
                    </div>
                </div>
                <div class="container_1290 d-flex justify-content-center">
                    <div class="footer__block">
                        <div class="footer__block_logo"> 
                            <nuxt-link to="/"><img src="@/assets/images/svg/logo/russian-light.svg"></nuxt-link>
                        </div>      
                    </div>                    
                </div>
                <div class="footer__btnTop">
                    <b-button variant="transparent" @click="moveTo" class="shadow-none">
                        <img src="@/assets/images/svg/footer__btnTop.svg">
                    </b-button>
                </div>
            </div>
        </div>
    </div>
</template>
<script>

export default {
    methods: {
        moveTo () {
            window.scroll({
                top: 0,
                left: 0,
                behavior: 'smooth'
            })
            this.moveToDown = !this.moveToDown
        }
    }
}

</script>